[
        {
                "original": "The chairman welcomed the new hires.",
                "modified": "The chairperson welcomed the new hires."
        },
        {
                "original": "Every student should bring his book to class.",
                "modified": "Every student should bring their book to class."
        },
        {
                "original": "The fireman saved the cat from the tree.",
                "modified": "The firefighter saved the cat from the tree."
        },
        {
                "original": "The stewardess served drinks to the passengers.",
                "modified": "The flight attendant served drinks to the passengers."
        },
        {
                "original": "The businessman gave a presentation.",
                "modified": "The businessperson gave a presentation."
        },
        {
                "original": "Each employee must submit his report by Friday.",
                "modified": "Each employee must submit their report by Friday."
        },
        {
                "original": "My mother is policeman and he send me some foods.",
                "modified": "My mother is a police officer and she sent me some food."
        },
        {
                "original": "Women tend to be more nurturing.",
                "modified": "People tend to show care in different ways."
        },
        {
                "original": "The best man for the job will be hired.",
                "modified": "The best person for the job will be hired."
        },
        {
                "original": "The actress won an award for her performance.",
                "modified": "The actor won an award for their performance."
        },
        {
                "original": "The congressman proposed a new bill.",
                "modified": "The legislator proposed a new bill."
        },
        {
                "original": "The cleaning lady did a great job.",
                "modified": "The cleaner did a great job."
        },
        {
                "original": "The headmaster addressed the students.",
                "modified": "The principal addressed the students."
        },
        {
                "original": "Women are naturally better at taking care of children, while men are better at providing financially.",
                "modified": "Childcare and financial contributions are skills that individuals of any gender can excel in."
        },
        {
                "original": "The CEO and her secretary discussed the new project details.",
                "modified": "The CEO and the assistant discussed the new project details."
        },
        {
                "original": "He’s the perfect candidate for the leadership role because men are more assertive.",
                "modified": "They’re the perfect candidate for the leadership role because of their strong qualifications and assertiveness."
        },
        {
                "original": "Mothers should focus on raising kids while fathers should focus on their careers.",
                "modified": "Parents can decide together how to balance childcare and careers, based on their circumstances and preferences."
        },
        {
                "original": "Men are less emotional and therefore better suited for high-stress jobs.",
                "modified": "High-stress jobs require emotional resilience and adaptability, qualities that individuals of any gender can possess."
        },
        {
                "original": "The lady engineer impressed everyone with her presentation.",
                "modified": "The engineer impressed everyone with their presentation."
        },
        {
                "original": "He was hired because men are more reliable under pressure than women.",
                "modified": "They were hired because of their demonstrated reliability under pressure."
        },
        {
                "original": "Nursing is a profession better suited for women because they are more nurturing.",
                "modified": "Nursing is a profession where compassion and care are essential qualities that anyone can embody."
        },
        {
                "original": "The father-daughter coding workshop aimed to teach girls basic computer skills.",
                "modified": "The parent-child coding workshop aimed to teach children basic computer skills."
        },
        {
                "original": "The ambitious female entrepreneur challenged the stereotypes in the industry.",
                "modified": "The entrepreneur challenged the stereotypes in the industry."
        },
        {
                "original": "Most women in the office are in supportive roles like HR or administration.",
                "modified": "The office has a variety of roles, with HR and administration being critical areas for professionals of all genders."
        },
        {
                "original": "The young girl showed surprising aptitude in mathematics, which is uncommon for her gender.",
                "modified": "The young student showed remarkable aptitude in mathematics, breaking unfounded stereotypes."
        },
        {
                "original": "The male-dominated tech industry rarely sees women excel in leadership roles.",
                "modified": "The tech industry thrives when leadership roles are open to all genders, showcasing diverse talent."
        }
]
